---
kind: method
id: M:Autodesk.Revit.DB.ParameterValue.IsSameType(Autodesk.Revit.DB.ParameterValue)
source: html/b6d6c24a-28f4-f449-29ed-efba259c7054.htm
---
# Autodesk.Revit.DB.ParameterValue.IsSameType Method

Tests another instance is of the same value type.

## Syntax (C#)
```csharp
public bool IsSameType(
	ParameterValue other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ParameterValue`) - The instance to compare with

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null